org-sample/sample.org
#+TITLE: org モードの使い方
#+AUTHOR: natsuko-k
#+DATE: \today
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [11pt,a4paper,xdvipdfmx]
#+OPTIONS: ^:{}
#+OPTIONS: toc:nil
# #+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{insertfig}
#+LATEX_HEADER: \usepackage{vmargin}
#+LATEX_HEADER: \setpapersize{A4}
#+LATEX_HEADER: \setmargrb{2cm}{1cm}{2cm}{1cm}


* org モードの起動
- Emacs で file.org を開くだけで、org モードになります。
* org モードの操作
| アイテマイズの行にカーソルを移動させて、Tab        | 当該アイテイズ以下を仕舞えます。   |
| アイテマイズの行にカーソルを移動させて、Shift-矢印 | アイテマイズの形式を変えられます。 |
| アイテマイズの行にカーソルを移動させて、Alt+q      | 自動整形                           |

他にもあるので、調べてください。

* org モードの記述法
** アイテマイズ各種
| *  | 章           |
| ** | 節           |
| -  | アイテマイズ |
  - アスタリスクを増やすと、さらに細かく節を作ることができます。

** 表
- "|" で項目を区切り、Tab を押すと、自動的に表の形に整形してくれます。

- 線を引きたい場合は、"|---" を記述してから Tab を押すと、罫線が引かれます。

| 1              |     2 |     3 |
|----------------+-------+-------|
| dummy          | dummy | dummy |

** tex のコマンドなどを使用したい場合 1
- 文章中で下記のように記述する

"#+BEGIN_LATEX"\\
ここは tex をそのまま書ける\\
"#+END_LATEX"

# サンプル

# #+BEGIN_LATEX
# \renewcommand{\em}{\it}
# \bibliographystyle{ieeetr}
# \bibliography{bib/sample}
# #+END_LATEX

** tex のコマンドなどを使用したい場合 2
- ヘッダに書く
# 例) 
# #+LATEX_HEADER: \usepackage{insertfig}

** 画像の挿入
- emacs 上で画像を見る
  - emacs 24 以降は emacs 上で画像を見れると思います。が、方法は忘れま
    した。調べてください。

- tex ファイルと同様に記述する
例)
# #+BEGIN_LATEX
# \insertfig{dummy}{dummy}
# #+END_LATEX

* Tex ファイルへの出力
- C-c C-e で出力形式を選びます。
  - Tex へ出力したい場合は、ここで ll を入力してください。
  - 他にも、様々なファイル形式への出力が可能です。

* おまけ
- 私は、Makefile で自動コンパイルできるようにしてあります。
  - make → tex ファイルをコンパイル
  - make clean → 不要なファイルを削除
  - make bibcom → bib ファイルを読みこむ場合のコンパイルを実行

