org-sample/sample.tex
% Created 2017-12-20 Wed 14:47
\documentclass[11pt,a4paper,xdvipdfmx]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{insertfig}
\usepackage{vmargin}
\setpapersize{A4}
\setmargrb{2cm}{1cm}{2cm}{1cm}
\author{natsuko-k}
\date{\today}
\title{org モードの使い方}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle


\section{org モードの起動}
\label{sec-1}
\begin{itemize}
\item Emacs で file.org を開くだけで、org モードになります。
\end{itemize}
\section{org モードの操作}
\label{sec-2}
\begin{center}
\begin{tabular}{ll}
アイテマイズの行にカーソルを移動させて、Tab & 当該アイテイズ以下を仕舞えます。\\
アイテマイズの行にカーソルを移動させて、Shift-矢印 & アイテマイズの形式を変えられます。\\
アイテマイズの行にカーソルを移動させて、Alt+q & 自動整形\\
\end{tabular}
\end{center}

他にもあるので、調べてください。

\section{org モードの記述法}
\label{sec-3}
\subsection{アイテマイズ各種}
\label{sec-3-1}
\begin{center}
\begin{tabular}{ll}
* & 章\\
** & 節\\
- & アイテマイズ\\
\end{tabular}
\end{center}
\begin{itemize}
\item アスタリスクを増やすと、さらに細かく節を作ることができます。
\end{itemize}

\subsection{表}
\label{sec-3-2}
\begin{itemize}
\item "|" で項目を区切り、Tab を押すと、自動的に表の形に整形してくれます。

\item 線を引きたい場合は、"|---" を記述してから Tab を押すと、罫線が引かれます。
\end{itemize}

\begin{center}
\begin{tabular}{rrr}
1 & 2 & 3\\
\hline
dummy & dummy & dummy\\
\end{tabular}
\end{center}

\subsection{tex のコマンドなどを使用したい場合 1}
\label{sec-3-3}
\begin{itemize}
\item 文章中で下記のように記述する
\end{itemize}

"\#+BEGIN\_LATEX"\\
ここは tex をそのまま書ける\\
"\#+END\_LATEX"

\subsection{tex のコマンドなどを使用したい場合 2}
\label{sec-3-4}
\begin{itemize}
\item ヘッダに書く
\end{itemize}

\subsection{画像の挿入}
\label{sec-3-5}
\begin{itemize}
\item emacs 上で画像を見る
\begin{itemize}
\item emacs 24 以降は emacs 上で画像を見れると思います。が、方法は忘れま
した。調べてください。
\end{itemize}

\item tex ファイルと同様に記述する
\end{itemize}
例)

\section{Tex ファイルへの出力}
\label{sec-4}
\begin{itemize}
\item C-c C-e で出力形式を選びます。
\begin{itemize}
\item Tex へ出力したい場合は、ここで ll を入力してください。
\item 他にも、様々なファイル形式への出力が可能です。
\end{itemize}
\end{itemize}

\section{おまけ}
\label{sec-5}
\begin{itemize}
\item 私は、Makefile で自動コンパイルできるようにしてあります。
\begin{itemize}
\item make → tex ファイルをコンパイル
\item make clean → 不要なファイルを削除
\item make bibcom → bib ファイルを読みこむ場合のコンパイルを実行
\end{itemize}
\end{itemize}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
